app/controllers/receptionist/users_controller.rb

	def create
	  @user = User.new(secure_params)
	  if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "encrypted_password", "subscription", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])
    if params[:user][:password].blank? && params[:user][:password_confirmation].blank?
      params[:user].delete(:password)
      params[:user].delete(:password_confirmation)
    end
    if @user.update_attributes(secure_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "users" SET "first_name" = ?, "last_name" = ?, "subscription" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", "Kamil"], ["last_name", "Siebyła"], ["subscription", "2015-10-20"], ["updated_at", "2015-05-07 17:31:28.447201"], ["id", 3]]